[
  {
    "courseName": "Beginner Course",
    "courseId": 1,
    "courseElements": [
      {
        "wordName": "Interest Rate",
        "wordId": 1,
        "isWordFinished": false,
        "description": [
          "An interest rate is either the cost of borrowing money or the reward for saving it. It is calculated as a percentage of the amount borrowed or saved.",
          "You borrow money from banks when you take out a home mortgage. Other loans can be used for buying a car, an appliance, or paying for education.",
          "Banks borrow money from you in the form of deposits, and interest is what they pay you for the use of the money deposited. They use the money from deposits to fund loans."
        ]
      },
      {
        "wordName": "Investment",
        "wordId": 2,
        "isWordFinished": false,
        "description": [
          "An investment is an asset or item acquired with the goal of generating income or appreciation.",
          "Appreciation refers to an increase in the value of an asset over time. When an individual purchases a good as an investment, the intent is not to consume the good but rather to use it in the future to create wealth.",
          "An investment always concerns the outlay of some capital today—time, effort, money, or an asset—in hopes of a greater payoff in the future than what was originally put in."
        ]
      },
      {
        "wordName": "Cash outflow",
        "wordId": 3,
        "isWordFinished": false,
        "description": [
          "In simple terms, the term cash outflow describes any money leaving a business. Obvious examples of cash outflow as experienced by a wide range of businesses include employees’ salaries, the maintenance of business premises and dividends that have to be paid to shareholders.",
          "The opposite of cash outflow is cash inflow, which refers to the money coming into a business. If the cash outflow of a business is greater than the cash inflow, then the business can be said to be in a fairly bad state. ",
          "Only by knowing what cash outflow is required for a business to operate can the owners be sure that the company has sufficient capital in place to carry on operating."
        ]
      },
      {
        "wordName": "Revenue",
        "wordId": 4,
        "isWordFinished": false,
        "description": [
          "Revenue is the total sales of a business within a reporting period.",
          "It is a quantification of the gross activity generated by a business, which is the average unit price charged to customers, multiplied by the number of units sold.",
          "Revenue is generally created when either goods or services are sold. However, it may also include other activities, such as the sale of memberships."
        ]
      },
      {
        "wordName": "Profit",
        "wordId": 5,
        "isWordFinished": false,
        "description": [
          "Profit is the surplus left from revenue after paying all costs. Profit is found by deducting total costs from revenue. In short: profit = total revenue - total costs.",
          "For example, if a firm has a total revenue of £100,000 and a total cost of £80,000, then they are left with £20,000 profit.",
          "Profit is the reward for risk-taking. A business can use profit to either reward owners, invest in growth, save for the future, in case there is a downturn in revenue."
        ]
      },
      {
        "wordName": "Loss",
        "wordId": 6,
        "isWordFinished": false,
        "description": [
          "Trading does not guarantee profit. A loss is made when the revenue from sales is not enough to cover all the costs of production.",
          " For example, if a company has a total revenue of £60,000 and a total cost of £90,000, then they have lost £30,000 from trading.",
          "Losses can be reduced or turned into profit by cutting costs or by increasing revenue."
        ]
      },
      {
        "wordName": "Debt",
        "wordId": 7,
        "isWordFinished": false,
        "description": [
          "Debt is an amount owed for funds borrowed. The lender agrees to lend funds to the borrower upon a promise by the borrower to pay interest on the debt, usually with the interest to be paid at regular intervals.",
          "A person or business acquires debt in order to use the funds for operating needs or capital purchases.",
          "In a business, debt may also be used as the source of funds for buying back shares in the business or to acquire another organization."
        ]
      },
      {
        "wordName": "Mortgage",
        "wordId": 8,
        "isWordFinished": false,
        "description": [
          "The term “mortgage” refers to a loan used to purchase or maintain a home, land, or other types of real estate.",
          "The borrower agrees to pay the lender over time, typically in a series of regular payments that are divided into principal and interest. The property serves as collateral to secure the loan.",
          "A borrower must apply for a mortgage through their preferred lender and ensure that they meet several requirements, including minimum credit scores and down payments."
        ]
      }
    ]
  },
  {
    "courseName": "Expert Course",
    "courseId": 2,
    "courseElements": [
      {
        "wordName": "Compound interest",
        "wordId": 1,
        "isWordFinished": false,
        "description": [
          "Compound interest is interest on the amount of money you have deposited or borrowed.",
          "When you’re investing or saving, compound interest is earned on the amount you deposited, plus any interest you’ve accumulated over time.",
          "However, when you’re borrowing, compound interest is charged on the original amount you were loaned, as well as the interest charges that are added to your outstanding balance over time."
        ]
      },
      {
        "wordName": "FICO score",
        "wordId": 2,
        "isWordFinished": false,
        "description": [
          "FICO is an acronym for Fair Isaac Corp., the company that came up with the methodology for calculating a credit score.",
          "Your score is based on several factors, including payment history, the length of your credit history and total amount owed.",
          "FICO scores range from 300 to 850, and the higher the score, the better the terms you may receive on your next loan or credit card. People with scores below 620 may have a harder time securing credit at a favorable interest rate."
        ]
      },
      {
        "wordName": "Net worth",
        "wordId": 3,
        "isWordFinished": false,
        "description": [
          "Your net worth is simply the difference between your assets (what you own) and liabilities (what you owe).",
          "You can calculate yours by adding up all of the money or investments you have, including the current market value of your home and car, as well as the balances in any checking, savings, retirement or other investment accounts.",
          "Then subtract all of your debt, including your mortgage balance, credit card balances and any other loans or obligations. The resulting net worth number helps you take the pulse of your overall financial health."
        ]
      },
      {
        "wordName": "Asset allocation",
        "wordId": 4,
        "isWordFinished": false,
        "description": [
          "Asset allocation is where you choose to put your money.",
          "The three major asset classes are stocks, bonds and cash (or cash equivalents). Each of these reacts differently to conditions in the market and economy, so be sure you choose those that line up best with your personal goals, risk tolerance and time horizon.",
          "For example, investing in stocks could give you strong growth over time, but they can also be quite volatile. Thus, one of the most common pieces of investment advice out there is to diversify your portfolio — or put your money in several buckets to make sure you’re risking as little as possible while still achieving your particular goals."
        ]
      },
      {
        "wordName": "Capital gains",
        "wordId": 5,
        "isWordFinished": false,
        "description": [
          "Capital gains are the difference between how much something is worth now versus how much it was originally purchased for.",
          "The gain, however, is only on paper until the asset or investment is actually sold. The flipside is a capital loss, which is the decrease in the asset’s or investment’s value since you purchased it.",
          "You pay taxes on both short-term capital gains (a year or less) and long-term capital gains (more than a year) when you sell an investment."
        ]
      },
      {
        "wordName": "Rebalancing",
        "wordId": 6,
        "isWordFinished": false,
        "description": [
          "Rebalancing is a standard practice in any portfolio. It is the process of bringing your stocks and bonds back to your desired percentages.",
          "For example, let’s say your target allocation is 60 percent stocks, 20 percent bonds and 20 percent cash. If the stock market has performed particularly well over the past year, your allocation may now have shifted to 70 percent stocks, 10 percent bonds and 20 percent cash.",
          "To rebalance your portfolio, you could sell some of your stocks and reinvest that money in bonds, or invest new money in bonds to bring the portfolio back to the original balance."  
        ]
      },
      {
        "wordName": "Term life insurance",
        "wordId": 7,
        "isWordFinished": false,
        "description": [
          "Term life insurance, also known as pure life insurance, is a type of life insurance that guarantees payment of a stated death benefit if the covered person dies during a specified term.",
          "Once the term expires, the policyholder can either renew it for another term, convert the policy to permanent coverage, or allow the term life insurance policy to terminate.",
          "If you die within the set term, your beneficiaries receive a payout. If you don’t, the policy expires with no value. The policy owner can decide to renew coverage after the term is over and can cancel at any time without penalty."
        ]
      },
      {
        "wordName": "Stock options",
        "wordId": 8,
        "isWordFinished": false,
        "description": [
          "Stock options can be offered by companies as management incentives. These options give you the right (but not the obligation) to buy your employer’s stock at a pre-set price within a specified time period.",
          "For example, if a manager helps boost the value of the company’s stock above the price of his or her option, the manager can buy the stock at the lower price and pocket the gain if they sell. But all shareholders benefit from the increased value of the stock.",
          "There are two types of options: puts, which is a bet that a stock will fall, or calls, which is a bet that a stock will rise."
        ]
      },
      {
        "wordName": "Defined-contribution plans",
        "wordId": 9,
        "isWordFinished": false,
        "description": [
          "Essentially, they are retirement plans that companies may offer as a benefit in which you, your employer or both make contributions on a regular basis.",
          "The money that goes into these accounts comes out of earnings pretax, so you don’t pay taxes on the amount you put away every year.",
          "Qualified withdrawals from these (usually those you make at age 59½ or older) are taxed as ordinary income. The value of the retirement benefit is determined by its investment performance."
        ]
      },
      {
        "wordName": "Umbrella insurance",
        "wordId": 10,
        "isWordFinished": false,
        "description": [
          "Umbrella insurance provides additional liability coverage beyond what your home, auto or boat insurance may provide.",
          "You might consider umbrella insurance if you’re at risk for being sued for property damage or other people’s injuries, such as a nanny or other employees who regularly work in your home.",
          "It can also protect your assets if someone sues you for slander or defamation of character."  
        ]
      }
    ]
  }
]
